{"sections":{"715d6f7c-78ad-4a39-bc87-241798612867":{"type":"hero-image","settings":{"image":"shopify:\/\/shop_images\/banner_984000d6-ca0a-4792-b671-8d993dab4fd8.jpg","image_mob":"shopify:\/\/shop_images\/banner_984000d6-ca0a-4792-b671-8d993dab4fd8.jpg"}},"403ff433-af6f-4ef8-bc3d-24789d692fda":{"type":"rich-text","settings":{"subheading":"","title":"","content":"<p>DS18 provides consumers with a 2-year limited warranty on any item purchased directly from DS18's official site or any approved DS18 shop for the original purchaser. We ensure the greatest experience possible when purchasing our items, and if there is an issue, we do our best to get it handled immediately.<br\/>Warranties are non-transferrable: if you sell or buy to\/from a third-party wholesaler your warranty will be null and void.<br\/>For more information, please read the parts below that are relevant to your individual product.<\/p><p><strong>What is covered in my warranty?<\/strong><\/p><p>DS18's 2 Year Limited Warranty protects against flaws in the initial production of their purchased good(s). Any faults or defects in materials or workmanship that present themselves during the warranty period will be corrected right away.<\/p><p><strong>Faults developed under the following circumstances are not covered by DS18’s warranty:<\/strong><\/p><ul><li>Damage resulting from falls, foreign item damage, etc.<br\/><\/li><li>Damage brought on by carelessness or abuse (including injury to returned goods from inadequate or bad packing).<\/li><li>Damage brought on by incorrect installation.<\/li><li>Damage caused by utilizing the product outside of the recommended parameters (for example, by overpowering speakers or subwoofers or by operating an amplifier below a 1 ohm load).<\/li><li>Damage brought on by distortion and\/or clipping (improper tuning).<\/li><li>Products that seem to have been tampered with (modified or repaired products). <\/li><li>Theft.<\/li><li>Any item acquired via a DS18 unofficial dealer.<\/li><\/ul><p>Item Abuse is a possibility and is classified as the repetitive returning of the same item with the same injury.<\/p><p>DS18 meticulously checks every returned item when evaluating whether a product is covered by warranty or not. Each returned product is extensively tested by DS18’s professional audio team to identify the root of the products malfunction. Based on the criteria above, DS18 holds complete discretion in deciding whether a product is covered by a warranty or not.<\/p><p>If a product is returned within two years of purchase and determined to be faulty according to our warranty guidelines, it will be replaced. DS18’s Return Policy may apply differently under Products purchased within 30 days, depending on their place of purchase.<\/p><p>Any item(s) qualified for warranty coverage may be replaced by DS18 with a device that has been reconditioned and is of equivalent quality. DS18 maintains the right to substitute the model of product that is most comparable to the original product in lieu of discontinued items that are being replaced under warranty.<\/p><p>We do everything we can to make sure you receive your items as soon as possible: however, in most circumstances, the claim is resolved within 48 hours. We ask that you give us 3 to 5 business days from the date of arrival at our facility for product testing and settlement of your claim.<br\/><br\/>If you added Guide Shipping Protection to your order and now are experiencing issues, please go to <a href=\"https:\/\/www.guideprotection.com\/protectit\/guidepro\/\" target=\"_blank\">https:\/\/www.guideprotection.com\/protectit\/guidepro\/<\/a> to file a claim. Once submitted a Guide representative will begin processing your claim and follow up with you via email.<\/p>","button_text":"","button_link":"","background_type":"full_width","text_width":"fill","text_position":"center","text_alignment":"left","background":"rgba(0,0,0,0)","text_color":"rgba(0,0,0,0)","button_background":"rgba(0,0,0,0)","button_text_color":"rgba(0,0,0,0)"}},"main":{"type":"warrantys","blocks":{"7403419e-855a-48cf-923e-0c2a73b4a466":{"type":"question","settings":{"title":"How do I Return Items for Warranty?","text":"<p>Any product(s) being replaced under warranty must be returned, per DS18. Prior to mailing any returned goods to DS18 for inspection, every item must first be assigned an RMA number. Items returned without an RMA number will be sent back without being examined for warranty purposes. <\/p><p>Package your items correctly! Any goods damaged upon arrival because of poor packing or shipping will not be covered by warranty and will be returned to sender.<\/p>"}},"8176b605-227f-48ff-8f5e-458a134ae2ef":{"type":"question","settings":{"title":"Shipment of Your Items Back","text":"<p>Once DS18 has come to a decision on your claim, customers are liable for the costs associated with the shipment of their replacement item. <\/p><p>After your warranty claim has been resolved, the item(s) being replaced or returned will be mailed to the address listed on the original order at the time of purchase. It is the customer's obligation to identify the address for the return when shipping the products to DS18.<\/p><p>DS18 is not liable for replacing any orders shipped to an incorrect address.<\/p>"}},"9a4e7002-b993-4e88-bc72-8ec456f72457":{"type":"question","settings":{"title":"How Do I Begin A Warranty Claim?","text":"<p>Fill out our warranty form <a href=\"https:\/\/ds18.com\/pages\/returns\" title=\"https:\/\/ds18.com\/pages\/returns\">here<\/a> and you will receive a response within 24-48 business hours.<\/p>"}},"f6e300e8-d003-4a00-8eaa-c3f8f406432c":{"type":"question","settings":{"title":"DISCLAIMER","text":"<p>Any damage resulting from the usage of our audio products is not the responsibility of DS18. <\/p><p>Use of a DS18 speaker, subwoofer, or amplifier signifies your admission of complete responsibility for their use. <\/p><p>In addition to the issues listed above, DS18 is not liable for hearing loss, personal injury, property damage to others, personal injury to oneself, or damage to a vehicle.<\/p>"}}},"block_order":["7403419e-855a-48cf-923e-0c2a73b4a466","8176b605-227f-48ff-8f5e-458a134ae2ef","9a4e7002-b993-4e88-bc72-8ec456f72457","f6e300e8-d003-4a00-8eaa-c3f8f406432c"],"settings":{"page_title_enable":false,"page_content_enable":false}}},"order":["715d6f7c-78ad-4a39-bc87-241798612867","403ff433-af6f-4ef8-bc3d-24789d692fda","main"]}